Revit 2027 API
BuiltInFailures.CopyPasteFailures.CantCopySymbolicElementToSelfOrientingFamily Property
 Cannot copy symbolic elements sketched in non-horizontal planes.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CantCopySymbolicElementToSelfOrientingFamily { get; }
Public Shared ReadOnly Property CantCopySymbolicElementToSelfOrientingFamily As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CantCopySymbolicElementToSelfOrientingFamily {
	FailureDefinitionId^ get ();
}
static member CantCopySymbolicElementToSelfOrientingFamily : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace